[{"AdvisoryID":"118","Rank":"1000","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-06 8:40:29 AM","Headline":"Rushing water conditions &ndash; USE EXTREME CAUTION","Description":"The access trail leading into Evanoff Provincial Park, to Fang Trailhead, crosses a creek. The current water levels are high; it is not advised to cross during high or rushing water conditions. Visitors are urged to use extreme caution when crossing this creek, or consider to reschedule their visit for another time."},{"AdvisoryID":"313","Rank":"50","Alert":"Y","DisplayAdvisoryDate":"N","AdvisoryDate":"2021-01-08 1:39:24 PM","Headline":"Cave and surrounding area is closed to public access","Description":"<p>          Until risks to public safety have been assessed and engagement with First Nations has been concluded, the newly discovered cave and surrounding area is closed to public access as per the <a href=&rdquo;docs/wells-gray-park-closure-20181214.pdf&rdquo; target=&rdquo;_blank&rdquo;>Directors Order <span class=&rdquo;fileinfo&rdquo;>[PDF]</span></a>.         </p>                 <p>  Any    member of the public in contravention of Order is subject to the    following:           <ul>            <li>             Under    Section 17 of the <em><a href=&rdquo;http://www.bclaws.ca/civix/document/id/complete/statreg/96344_01&rdquo;>Park Act</a></em>, Section 28:             <ul>              <li>               <strong>28</strong> (1) A person who     contravenes any provision of this Act commits an offence     and is liable to a fine of up to $1,000,000 or a term of     imprisonment of not more than one year or both.              </li>              <li>               (3) When a contravention of the Act or     regulations continues for more than one day, the person is guilty of a     separate offence for each day on which the contravention continues.              </li>             </ul>            </li>           </ul>                             <a href=&rdquo;/explore/parkpgs/wells_gry/faq-wells-gray-cave.html&rdquo;>Wells Gray Cave Frequently Asked Questions</a> </p>"},{"AdvisoryID":"314","Rank":"40","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-08 3:32:04 PM","Headline":"Nordic Grooming","Description":"<p> Majerus Warming Hut <ul><li>Groomed from Majerus Warming Hut (Majerus Farm trailhead) to King Warming Hut (6.6 km one way)</li> <li>Groomed from Majerus Warming Hut (Majerus Farm trailhead) to Blackwater Cliffs Viewpoint (3.1km one way)</li><li><a href=&rdquo;/explore/parkpgs/wells_gry/wg-x-country-ski-map.pdf&rdquo; target=&rdquo;_blank&rdquo;>Majerus Warming Hut trails</a></li></ul></p> <p> Clearwater Valley Road<ul><li> Groomed from yellow gate (intersection with Helmcken Falls road) to Clearwater Lake</li> <li>Trackset from yellow gate to Red Springs (7km one way) </li><li><p><a href=&rdquo;/explore/parkpgs/wells_gry/wells_corridor.pdf&rdquo; target=&rdquo;_blank&rdquo;>Park Map &ndash; Corridor Area</a></li></ul></p>"},{"AdvisoryID":"251","Rank":"21","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-20 2:54:14 PM","Headline":"Mount Robson Marathon","Description":"Please check back for updates"},{"AdvisoryID":"250","Rank":"20","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-20 2:50:38 PM","Headline":"It is now winter in Mount Robson Park. Ensure you are checking weather and avalanche conditions prior to recreating in the park.","Description":""},{"AdvisoryID":"100","Rank":"3","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-07-30 3:22:54 PM","Headline":"Access to Lake Lovely Water trailhead","Description":"Access is from the west side of the Squamish River. The east side of the river is First Nations land and BC Parks does not recommend using the dirt road to access the trailhead due to land use issues. Use of the cable car is also PROHIBITED. Helicopter and boat services are available, see the <a href=&rdquo;#Location&rdquo;>Location</a> section below for further details."},{"AdvisoryID":"322","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-14 9:16:14 AM","Headline":"Cougar observed in park","Description":"Please be aware that a cougar has been observed in the park. Be cougar smart and be sure to keep your pets on leash."},{"AdvisoryID":"321","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"N","AdvisoryDate":"2021-01-12 2:37:04 PM","Headline":"Access to this protected area is from the Copper River Forest Service Road","Description":"<strong>Drive with caution.</strong> There may be rocks or wildlife on the road and other industrial traffic such as logging trucks, heavy machinery, or other vehicles."},{"AdvisoryID":"318","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-12 1:15:29 PM","Headline":"Due to COVID-19 restrictions at Covert Farms, the access to MacIntyre Bluff / n?aylintn trail through Covert Farms is not currently open to the public","Description":""},{"AdvisoryID":"316","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-08 4:49:30 PM","Headline":"Cabins closed","Description":"Cabins closed for overnight and day-use due to COVID-19 precautions. The park is open for day-use only and camping is not permitted."},{"AdvisoryID":"315","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-08 4:31:11 PM","Headline":"Sani-dump station closed for repairs","Description":"The BC Parks Sani-Dump Station is currently closed while repairs are being conducted. Please make alternative arrangements if requiring waste disposal. We appreciate your patience."},{"AdvisoryID":"312","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-08 11:32:34 AM","Headline":"Reservations for 2021","Description":"Release dates for 2021 reservations (including Berg Lake Trail and Bowron Lake Canoe Circuit) will be determined in early 2021 and advance notice will be provided once they are confirmed."},{"AdvisoryID":"311","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-07 11:07:44 AM","Headline":"Storm damage","Description":"<p>Please be advised that the <b>Millennium Trail has been closed due to storm damaged facilities</b>.</p> <p>Most of the parks trails have been subject to windthrown trees and debris as a result of recent high wind and rainfall events. <br> Please use caution throughout the park as Park Operators work to assess and remove windfalls on trails and sites. </p> <p>Your cooperation is appreciated. </p>"},{"AdvisoryID":"308","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2021-01-04 4:28:49 PM","Headline":"Ongoing environmental spill response","Description":"<p><b>Notice to Park Visitors</b></p>  <p>Please be advised that there is an ongoing environmental spill response on Zuciarte Channel in Bligh Island Park as a result of a historic shipwreck.  An <i>Emergency Zone</i> has been established by the <i>Canadian Coast Guard</i> for all mariners as per the link below: <br> <a href=&rdquo;http://www.spillresponsebc.ca/marinenotice/&rdquo;>http://www.spillresponsebc.ca/marinenotice/</a></p><p><b>Please avoid this designated area.</b></p> <p>For more information on the Bligh Island Shipwreck please see the link below: <br> <a href=&rdquo;http://www.spillresponsebc.ca/&rdquo;>http://www.spillresponsebc.ca/</a></p>"},{"AdvisoryID":"305","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-31 1:20:06 PM","Headline":"Parking Signs &ndash; Zopkios Brake Check area","Description":"<p> Visitors may notice parking signs at the Highway 5 Zopkios Brake Check area. The Ministry of Transportation and Infrastructure advises there are no new parking restrictions. The previous signs were becoming weathered and required replacement.</p> <p> For safety reasons, the signs are intended to prevent commercial vehicles from parking and congesting the Zopkios Brake Check area which significantly impacts the maintenance contractors ability to operate during storm cycles. </p> <p> Enforcement of parking by passenger vehicles isn&rsquo;t planned as long as parking does not impede traffic or winter maintenance activities. </p> <p> BC Parks and MOTI are working together to explore long term parking and access improvements at the Coquihalla Summit Recreation Area.</p>"},{"AdvisoryID":"302","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-30 10:24:55 AM","Headline":"Park is open for the cross-country ski season","Description":"Fuel management work is complete for the season and the park is now re-opened for winter cross-country use. Day-Use warming huts are open, following COVID-19 protocols: <ul> <li> Facility is for day-use only: overnight stays are not permitted </li> <li> Provincial Health Officer COVID-19 protocols must be followed</li> <li> Wear a mask and maintain a minimum of 2 meters physical distancing except with members of the same household</li> <li> This facility is un-serviced: it is not cleaned and cleaning products are not provided </li> <li> Visitors are responsible for their own cleaning and sanitation</li> <li> Maximum capacity for the main warming hut is 4 people, with a maximum duration of 20 minutes to allow use by others</li> </ul>"},{"AdvisoryID":"301","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-30 9:13:00 AM","Headline":"To protect the health of our visitors and staff, the following facilities closed","Description":"Kaslo Lake cook shelter<br>  Gibson Lake, Silverspray, Woodbury, & Slocan Chief cabins"},{"AdvisoryID":"304","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-30","Headline":"Camp host opportunity for Croteau Lake","Description":"BC Parks is currently accepting applications for camp hosts at the Croteau Lake Groupsite for the 2021 season. Basic information can be found in the <a href=&rdquo;https://bcparks.ca/explore/parkpgs/strath/croteau_lk_brochure.pdf?v=1609361450451&rdquo; target=&rdquo;_blank&rdquo;>brochure</a>. Host duties may be adjusted for the 2021 season due to COVID-19. For further information please contact <a href=&rdquo;mailto:james.godfrey@gov.bc.ca&rdquo;>james.godfrey@gov.bc.ca</a>."},{"AdvisoryID":"300","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-23 3:14:46 PM","Headline":"Hazard warning -- winter road conditions","Description":"<p>Narrow winding mountain road, expect snow, ice and steep grades. <br><b> Must use winter tires, must carry chains.</b></p>  <p>Chains <b>must be installed</b> to access the upper parking lot at Diamond Head (Red Heather, Elfin Lakes), and the parking lot at Rubble Creek (Garibaldi Lake, Taylor Meadows).</p>  <p>Vehicles blocking snow removal equipment on road will <b>be towed at owners&rsquo; expense</b>.</p> <p>Grader requires minimum 20 feet of road width.</p>  <p>Vehicles are advised not to park on Ring Creek Road as they may be subject to Municipal Towing.</p>  <p>Chains are mandatory beyond the chain up area, as per posted signage or direction by park staff.</p> <p><b>Failure to comply will result in a $115 fine and or eviction from the park.</b></p>"},{"AdvisoryID":"298","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-22 4:56:07 PM","Headline":"Improvements to French Beach Provincial Park have now been completed","Description":"Recent upgrades have improved the convenience, visitor satisfaction, and accessibility throughout the campground and day-use areas of the park. Eleven new fully accessible toilets have replaced all the existing toilets in these locations. In addition, all of the campsite driveways have been widened to allow easier and safer access for larger trailers and RV&rsquo;s to each site."},{"AdvisoryID":"297","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-22 4:48:40 PM","Headline":"Morton Lake Park will be inaccessible from Nov 25 to Jan 11, 2020","Description":"The Ministry of Forests, Lands, Natural Resource Operations and Rural Development is in the process of providing much needed road work and rehabilitation on the Morton Lake Forest Road accessing Morton Lake Park.  Due to heavy equipment on site through this period the road is closed to all traffic."},{"AdvisoryID":"296","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-22 4:45:51 PM","Headline":"Naiset Huts Closed until February 3rd, 2021","Description":"Please be advised that the Naiset Huts will be closed until February 3rd, 2021 due to Covid 19 impacts.  The huts may be subject to further closures so be aware this is tentative. Please continue to monitor this web page in addition to Mount Assiniboine Lodge page: <a href=&rdquo;www.assiniboinelodge.com&rdquo; target=&rdquo;_blank&rdquo;>www.assiniboinelodge.com</a> for any updates regarding the status of this closure."},{"AdvisoryID":"292","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-21 4:00:00 PM","Headline":"","Description":"<h5>Park Access and Traffic</h5> <ul> <li>Cypress Park is expected to experience unprecedented demand for access over the winter holiday season.</li> <li>All park visitors should check <a href=&rdquo;https://twitter.com/Cypress_Park_PO&rdquo; target=&rdquo;_blank&rdquo;>@Cypress_Park_PO</a> on Twitter for up-to-date traffic and park access info before planning your trip to the park and while on route to the park. </li> <li>Digital message boards will be posted on the access road with live updates to notify of current traffic conditions. Visitors should heed these signs and if the signs say the lots are full, park visitors should plan to come to the park another time. </li> <li>Free public parking is available in Parking Lot 3B. Parking fees will be implemented this year in the Nordic Area Lot 4 and in Lots 1,2, and 3A and adjacent roadsides in the Downhill Area. These fees will be charged only to vehicles whose occupants have not pre-purchased a ticket or Pass for planned activities within the Alpine or Nordic Ski Area Boundaries.</li> </ul> <h5>COVID-19 Safety Plan at Cypress Provincial Park:</h5> <ul> <li>All park visitors must follow the Provincial Health Officer COVID-19 safety guidelines. Visitors must wear a mask in common spaces, stay 2 meters apart, hand sanitizer often, and do not come to the park if you are feeling unwell. Please see <a href=&rdquo;https://bcparks.ca/covid-19/docs/Camping-During-COVID-19.pdf?v=1608592901436&rdquo; target=&rdquo;_blank&rdquo;>BC Parks COVID-19 information for park visitors</a>.</li> <li>Access to the Cypress Mountain Resorts facilities are limited to ski pass holders to ensure adherence to physical distancing requirements. </li> <li>Park visitors may use the Brown Bag room, Black Mountain Lodge washrooms, or the additional portable toilets provided at trail heads and in parking lot 3B. </li> <li>Pack a lunch as there are no food and beverage services available for non-ski hill pass holders. </li> <li>A reminder that all park visitors need a backcountry waiver tag to access the park. These are available in the Brown Bag room at the Black Mountain Lodge.</li> <li>BC Parks will have park ranger staff on site to assist in managing traffic, and to provide education and compliance to ensure that park visitors are safe and are respecting the PHO guidelines and COVID-19 safety plans. <a href=&rdquo;https://cypressmountain.com/latest-news/covid-19-plan&rdquo; target=&rdquo;_blank&rdquo;>Cypress Mountain Resort&rsquo;s COVID-19 Safety Plan</a> and <a href=&rdquo;https://bcparks.ca/covid-19/docs/Camping-During-COVID-19.pdf?v=1608592901436&rdquo; target=&rdquo;_blank&rdquo;>BC Parks COVID-19 Visitor Information</a>. </li> </ul>  <h5>Travelling through the Backcountry Access Corridor </h5> To access the Black Mountain Plateau and Bowen Lookout Winter Trail (Yew Lake), you need to travel through the Backcountry Access Corridor (BAC). <ul> <li>Get your Yellow Tag (release of liability) before recreating on the Yew Lake trails and beyond. Yellow tags are available at the Black Mountain Lodge. </li> <li>Washrooms are available for backcountry park visitors in the <strong>Black Mountain Lodge</strong>. </li> <li>Follow the marked route through the downhill ski area to the winter trails. </li> <li><a href=&rdquo;https://bcparks.ca/explore/parkpgs/cypress/winter-trails-and-bac.pdf&rdquo; target=&rdquo;_blank&rdquo;>Backcountry Winter Trails Map</a> </li></ul> <h5>Winter Safety</h5> <ul> <li>Refer to the know before you go section to learn about parking, closures and other information. </li> <li>Check the avalanche conditions at <a href=&rdquo;https://avalanche.ca/&rdquo; target=&rdquo;_blank&rdquo;>avalanche.ca</a> and bring the appropriate equipment.</li> <li>Prepare your vehicle for winter travel.</li> <li>Plan your trip around daylight hours for warmth and light.</li> <li>Wear warm layers & appropriate footwear.</li> <li>Make a Trip Plan (<a href=&rdquo;https://plan.adventuresmart.ca/&rdquo; target=&rdquo;_blank&rdquo;>AdventureSmart</a> has a great app) and let a friend know your plans.</li> </ul>"},{"AdvisoryID":"294","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 4:07:42 PM","Headline":"","Description":"<h5>Park Access and Traffic Management</h5> <p>Mt. Seymour Park is expected to experience unprecedented demand for access over the winter holiday season.</p> <p>In good weather on weekends and holidays, the parking lots will reach capacity before 9 AM. <p>All park visitors should check <a href=&rdquo;https://twitter.com/Seymour_Park_PO&rdquo; target=&rdquo;_blank&rdquo;>@Seymour_Park_PO</a> on Twitter for up-to-date traffic and park access info before planning your trip to the park and while on route to the park. </p> <p>Digital message boards will be posted on the access road with live updates to notify park visitors when the parking lots are full. When lots are full, visitors will be turned away. Visitors should heed these signs and if the signs say the lots are full, park visitors should plan to come to the park another time.</p>  <h5>COVID-19 Safety Plan at Mount Seymour Provincial Park</h5> <p>All park visitors must follow the Provincial Health Officer COVID-19 safety guidelines. Visitors must wear a mask in common spaces, stay 2 meters apart, hand sanitizer often, and do not come to the park if you are feeling unwell. </p> <ul><li> <a href=&rdquo;https://bcparks.ca/covid-19/docs/Camping-During-COVID-19.pdf?v=1608592901436&rdquo; traget=&rdquo;_blank&rdquo;>BC Parks COVID-19 Visitor Information</a></li> </ul> <p>BC Parks will have park ranger staff on site to assist in managing traffic, and to provide education and compliance to ensure that park visitors are safe and are respecting the PHO guidelines and COVID-19 safety plans. </p> <ul> <li><a href=&rdquo;https://mtseymour.ca/covid-19-winter-protocols&rdquo; target=&rdquo;_blank&rdquo;>Mt Seymour Resort COVID-19 Winter Protocols</a></li> <li><a href=&rdquo;https://bcparks.ca/covid-19/docs/Camping-During-COVID-19.pdf?v=1608592901436&rdquo; traget=&rdquo;_blank&rdquo;>BC Parks COVID-19 Visitor Information</a> </li> </ul>  <h5>Winter Safety</h5> <ul> <li>Refer to the Know Before You Go section to learn about parking, closures and other information. </li> <li>Check the avalanche conditions at <a href=&rdquo;https://avalanche.ca/&rdquo; target=&rdquo;_blank&rdquo;>avalanche.ca</a> and bring the appropriate equipment.</li> <li>Prepare your vehicle for winter travel.</li> <li>Plan your trip around daylight hours for warmth and light.</li> <li>Wear warm layers & appropriate footwear.</li> <li>Make a Trip Plan (<a href=&rdquo;https://plan.adventuresmart.ca/&rdquo;>AdventureSmart</a> has a great app) and let a friend know your plans.</li> </ul>"},{"AdvisoryID":"291","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 3:10:19 PM","Headline":"Osprey Campground/Group Use and Day Use area and parking lot is open for the winter","Description":"Plowed winter access to Kokanee Creek Park is by the Osprey campground/ Group Use and Day use road (to the south west of the Nature Center). The main Park entrance is not plowed and is closed for road safety at this time. Winter conditions may be icy, please take care."},{"AdvisoryID":"290","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-12-18 2:58:53 PM","Headline":"Pets must be on leash at all times","Description":"<p>Kokanee Creek estuary area is important habitat for migratory and resident waterfowl and shorebirds. Thanks for doing your part to help sensitive wildlife by keeping your dog on a leash.</p> <p>Pets/domestic animals must be on a leash at all times and are not allowed in beach areas. This applies year-round. A dog beach is beside the boat launch at the north-east end of the park. Park visitors are responsible for their behaviour and must dispose of their excrement.</p>"},{"AdvisoryID":"289","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 2:41:31 PM","Headline":"King Warming hut open for day use with limited capacity","Description":"<p>The King Warming hut in Wells Gray is open for day use with the maximum capacity of 2 person or only the members of the same household. To allow use by others, spend maximum 20 minutes inside. </p> <p>Provincial Health Officer Covid-19 protocols must be followed. Masks must be worn in all indoor public spaces in British Columbia. </p> <p>Facility is un-serviced: it is not cleaned and cleaning products are not supplied. Visitors are responsible for their own cleaning and sanitation. Garbage and personal items must be packed out.</p>"},{"AdvisoryID":"288","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 2:38:51 PM","Headline":"Cheakamus Lake Road closure","Description":"Cheakamus Lake Road (AKA Cheakamus Forest Service Road) is currently closed to public access for forest fire fuel treatment work. Access to the park via the Cheakamus Lake trailhead will re-open in the Spring"},{"AdvisoryID":"287","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 2:33:37 PM","Headline":"Day use area open through winter season","Description":"<p> We are happy to have a new volunteer partnership agreement in place between Tourism Pemberton Destination Marketing Association, Daniel Schranz Contracting Ltd., and BC Parks, for the benefit of the entire community and all park visitors.  This collaborative agreement allows access to Nairn Falls Provincial Park day use area throughout the winter months.</p> <p> Public access to this area will be allowed six days per week Access to the site will be closed on Sunday afternoon at 1700 hours (5:00pm) through to Monday afternoon at 1700 hours (5:00pm) in order to accommodate another BC Parks volunteer partnership with Spud Valley Nordics Association (SVNA).  SVNA operate their programs on Monda</p> <p>Public are asked to please stay off of the groomed ski tracks at all times, to follow signage and to stay on designated recreational access trails to avoid damaging the Nordic trails.  There is No Overnight Parking allowed in a day use area. If overnight parking occurs, BC Parks will return to a closed gate operational model.  This is a trial agreement for this winter season of 2020-21.</p>"},{"AdvisoryID":"286","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 2:11:25 PM","Headline":"Trans Mountain Expansion Project Construction","Description":"<p>Trans Mountain Expansion Project construction is now underway in the Recreation Area. During the winter season visitors may notice workers in the area. In the summer visitors may notice increased construction activities including clearing, grading, heli-logging, trenching and pipe installation. All construction activities have received appropriate permits and authorizations.</p> <p>All trails remain open although short detours may be in place during the summer. Please follow the instructions of any onsite personnel. For more information visit <a href=&rdquo;transmountain.com/coquihalla&rdquo;>transmountain.com/coquihalla</a> or contact <a href=&rdquo;mailto:info@transmountain.com&rdquo;>info@transmountain.com</a> / 1.866.514.6700."},{"AdvisoryID":"284","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 1:16:08 PM","Headline":"Backcountry skiers &ndash; please call for safety information before heading out","Description":"<p>Whistler Blackcomb Mountain Operations requests all visitors skiing into their boundaries from the backcountry areas to call the number below and get the latest safety information. Mountain Operations continues to make all areas within their resort as safe as possible for all visitors. Calling this number will ensure you are not unknowingly entering into an unsafe area.</p> <p><strong>Ski Area Boundary Status: (604) 905-2324. You will hear a voice mail tree; 1 for the Whistler boundaries, 2 for the Blackcomb boundaries, 3 is for the weather forecast.</strong></p>"},{"AdvisoryID":"281","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18 9:33:30 AM","Headline":"BC Parks has reassessed the closure and the closure area has been amended","Description":"<p>In May 2019, BC Parks closed the Nlh&#160;xten/Cerise Creek Conservancy after two landslides from Joffre Peak heavily impacted the Cerise Creek watershed within the Conservancy. <p> <p>BC Parks has reassessed the closure and the closure area has been amended. Public access is not permitted within the immediate slide path as outlined in red on the map posted on the Nlh&#160;xten/Cerise Creek Conservancy website. There is one temporary route located at the midpoint of the landslide track. This route is unmaintained and is not a designated trail. The time crossing the path must be minimized. The remaining areas of the Conservancy are now open to public access. <p> <p>The Keith Flavelle Hut (Keith&rsquo;s Hut) is outside the closure area, however, the Hut remains closed due to PHO COVID-19 restrictions. <p> <p>Signage has been posted at the trailheads and on the conservancy website. <p> <p>BC Parks will be conducting a further assessment of the closure area in 2021. <p>"},{"AdvisoryID":"283","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-18","Headline":"BC Parks has reassessed the closure and the closure area has been amended","Description":"<p>In May 2019, BC Parks closed the Nlh&#160;xten/Cerise Creek Conservancy after two landslides from Joffre Peak heavily impacted the Cerise Creek watershed within the Conservancy. </p> <p>BC Parks has reassessed the closure and the closure area has been amended. Public access is not permitted within the immediate slide path as outlined in red on the map posted on the Nlh&#160;xten/Cerise Creek Conservancy website. There is one temporary route located at the midpoint of the landslide track. This route is unmaintained and is not a designated trail. The time crossing the path must be minimized. The remaining areas of the Conservancy are now open to public access. </p> <p>The Keith Flavelle Hut (Keith&rsquo;s Hut) is outside the closure area, however, the Hut remains closed due to PHO COVID-19 restrictions. /<p> <p>Signage has been posted at the trailheads and on the conservancy website. </p> <p>BC Parks will be conducting a further assessment of the closure area in 2021. </p> <ul><li><a href=&rdquo;joffre-closure-zones-nov-2020.jpg&rdquo; target=&rdquo;_blank&rdquo;>Closure Area Map</a></li></ul>"},{"AdvisoryID":"280","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-16 3:00:11 PM","Headline":"Police Meadows Cabin is closed","Description":"Police Meadows Cabin is currently closed due to COVID-19. Please continue to monitor this web page for ongoing updates related to facility closures and impacts due to COVID-19."},{"AdvisoryID":"279","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-16 2:59:31 PM","Headline":"Surprise Creek Cabin is closed","Description":"Surprise Creek Cabin is currently closed due to COVID-19. Please continue to monitor this web page for ongoing updates related to facility closures and impacts due to COVID-19."},{"AdvisoryID":"278","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-16 9:36:00 AM","Headline":"Voluntary winter closure area to protect critical wolverine habitat","Description":"Voluntary Winter Closure Area &ndash; to protect critical wolverine habitat (4.4 km<sup>2</sup> polygon within Kokanee Glacier Park). Thank you for observing this voluntary closure by not accessing this area of the park from January 15 to May 15, 2021. <ul> <li><a href=&rdquo;docs/kokanee-glacier-voluntary-winter-closure-area-map-20201216.pdf&rdquo; target=&rdquo;_blank&rdquo;>Voluntary Winter Closure Area Map <span class=&rdquo;fileinfo&rdquo;>[PDF]</span></a></li> <li><a href=&rdquo;docs/kokanee-glacier-voluntary-winter-closure-more-info-20201216.pdf&rdquo; target=&rdquo;_blank&rdquo;>More information on 2021 voluntary winter closure <span class=&rdquo;fileinfo&rdquo;>[PDF]</span></a></li></li> </ul>"},{"AdvisoryID":"285","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-11 1:47:32 PM","Headline":"Trail washout Sombrio River Suspension Bridge to West Sombrio Campsite","Description":"Due to recent storm surges and king tides along the Juan de Fuca Marine Trail there is a significant wash-out west of the Sombrio River Suspension Bridge to the West Sombrio Campsite. This section of trail is currently not passable."},{"AdvisoryID":"277","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-08","Headline":"Spahats Falls parking lot and trail open for winter use","Description":"Spahats Falls parking lot and trail plowed."},{"AdvisoryID":"275","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-04 4:58:51 PM","Headline":"Cabins closed","Description":"Itcha & Kettle cabin in Itcha Ilgachuz Park will be closed for the 2020/21 winter season due to COVID-19 restrictions."},{"AdvisoryID":"243","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-04 11:30:38 AM","Headline":"Travel to park not advised","Description":"Due to a significant wind and rain event on November 17, 2020, facilities in the park have been impacted making some trails impassable. At this time, there is no access beyond 14.5Km (Hansen Lagoon) to Nels Bight and the Cape Scott Lighthouse. Assessments are underway to determine extent of damage to other facilities on the North Coast Trail. The full extent of damage in all areas of the park are unknown at this time. Please use extreme caution if visiting the park during this time and continue to check back for updates."},{"AdvisoryID":"273","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-04 10:48:03 AM","Headline":"Widgeon Lake trail closed","Description":"The trail to Widgeon Lake has been closed due to a failing crossing at Hanging Creek. Please do not attempt accessing Widgeon Lake via the Widgeon Lake trail at this time."},{"AdvisoryID":"272","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-03 8:55:54 AM","Headline":"Water facilities closed during cold weather","Description":"<p>During periods of freezing temperatures, all above ground water sources such as the drinking fountains, water taps and the sani-station will be shut down and will remain off until temperatures rise above 0&deg;C.</p> <p>This most often means water taps and the sani-station are turned off and closed at night and turned on the following day, late morning, once temperatures rise above freezing.</p> <p>Service interruptions may last longer during cold snaps.</p> <p>Water is accessible at the day-use washroom building and the frost-free tap outside the campground shower building (closed during the winter).</p> <p>Access may be limited, so we ask that campers plan ahead and bring a suitable supply of potable water.</p>"},{"AdvisoryID":"271","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-01 1:49:31 PM","Headline":"Reservations required during peak season","Description":"<p>Reservations are required during peak season (June 26 &ndash; September 30) for all overnight stays in the core area of Mount Assiniboine Provincial Park (Magog Lake and Og Lake campgrounds).</p> <ul><li><a href=&rdquo;http://bcparks.ca/reserve/mt-assiniboine/questions-answers.html&rdquo; target=&rdquo;_blank&rdquo;>Mount Assiniboine Reservation FAQ</a></li></ul> <p>Please check current snowpack conditions before reserving a tent pad at the beginning of peak season. Snow melt typically does not occur at Magog campground until mid July. The <a href=&rdquo;http://assiniboinelodge.com/webcam&rdquo; target=&rdquo;_blank&rdquo;>Assiniboine Lodge webcam</a> is a good reference to gauge snowpack at Magog campground.</p>"},{"AdvisoryID":"270","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-01 1:26:41 PM","Headline":"Bridge damaged on Shingle Spit/Ford Cove trail","Description":"A bridge along the Shingle Spit/Ford Cove trail was badly damaged in a recent storm event and is currently closed due to safety concerns"},{"AdvisoryID":"268","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-01 9:55:47 AM","Headline":"Visitors encouraged to wear masks while travelling through congested areas","Description":"<p><strong>Mount Seymour Provincial Park</strong> is a popular destination for winter recreation, and everyone must take precautions for a fun and safe trip to the park. All visitors are encouraged to wear a mask while travelling through congested areas including parking lots, at the trailheads, and at viewing areas. As per PHO regulations, all park visitors must wear a mask when inside any park facility. Be sure to stay 2 meters apart, and don&rsquo;t forget to bring your own hand sanitizer and hand sanitize often. All park visitors must adhere to the <a href=&rdquo;https://mtseymour.ca/covid-19-winter-protocols&rdquo; target=&rdquo;_blank&rdquo;>Mt Seymour Resort COVID-19</a> winter protocols when transiting through the ski base area or using any facilities </p>"},{"AdvisoryID":"267","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-12-01 9:32:56 AM","Headline":"Visitors encouraged to wear masks while travelling through congested areas","Description":"<p><strong>Cypress Provincial Park</strong> is a popular destination for winter recreation, and everyone must take precautions for a fun and safe trip to the park. All visitors are encouraged to wear a mask while travelling through congested areas including parking lots, at the trailheads, and at viewing areas. As per PHO regulations, all park visitors must wear a mask when inside any park facility. Be sure to stay 2 meters apart, and don&rsquo;t forget to bring your own hand sanitizer and hand sanitize often. All park visitors must adhere to the <a href=&rdquo;https://cypressmountain.com/latest-news/covid-19-plan&rdquo; target=&rdquo;_blank&rdquo;>Cypress Mountain Resort COVID-19 Operational Plan</a> when transiting through the ski base area, which includes mandatory mask wearing.</p>"},{"AdvisoryID":"266","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-30 4:48:39 PM","Headline":"Angel Springs parking lot and Myra Bailout Trail areas closed until further notice","Description":"The Angel Springs parking lot and Myra Bailout Trail areas are closed as of December 1 to allow for continuation of an ecosystem restoration project. There will be equipment operating in this area and on Little White Forest Service Road. Please obey all on-site signage and stay out of the work area until further notice."},{"AdvisoryID":"265","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-11-30 2:06:40 PM","Headline":"Fuel management projects in West Arm Park this fall","Description":"<p>Please be advised that BC Parks is conducting fuel management projects in West Arm Park this fall (September to December). To ensure public safety during these treatments, there will be recreational access closures associated with the projects.</p> <ul> <li>12.7-hectare hand treatment along Lasca Roa. There will be no recreational access beyond the gate as of September 1st, until mid-December.</li> <li>15.4-hectare mechanical treatment at the end of Lasca Road. There will be no recreational access beyond the gate as of September 1st, until mid-December.</li> </ul> <p>Please obey all informational signage posted on site and please check this website often for the latest updates.</p> <p>For more information, please call 250 489-9211.</p>"},{"AdvisoryID":"269","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-30 10:39:37 AM","Headline":"Majerus Warming Hut open for day use in Wells Gray","Description":"<p>The Majerus Warming hut in Wells Gray is open for day use with a maximum capacity of 4 people at any one time. Provincial Health Officer Covid-19 protocols must be followed. Maintain a minimum of 2 meters physical distancing except with members of your own household. </p><p>Facility is un-serviced: it is not cleaned and cleaning products are not supplied. Visitors are responsible for their own cleaning and sanitation. Garbage and personal items must be packed out. </p>"},{"AdvisoryID":"262","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-30 9:38:27 AM","Headline":"Visitors encouraged to wear masks while travelling through congested areas","Description":"<p><strong><b>Cypress Provincial Park</b></strong> is a popular destination for winter recreation, and everyone must take precautions for a fun and safe trip to the park. All visitors are encouraged to wear a mask while travelling through congested areas including parking lots, at the trailheads, and at viewing areas. As per PHO regulations, all park visitors must wear a mask when inside any park facility. &nbsp;Be sure to stay 2 meters apart, and don&rsquo;t forget to bring your own hand sanitizer and hand sanitize often. All park visitors must adhere to the <a href=&rdquo;https://cypressmountain.com/latest-news/covid-19-plan&rdquo;>Cypress Mountain Resort COVID-19 Operational Plan</a> when transiting through the ski base area, which includes mandatory mask wearing. </p>"},{"AdvisoryID":"261","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-25 2:40:03 PM","Headline":"Contact tracing requirement for campers","Description":"Due to the current Island Health order requiring contract tracing information be provided for all campers in the Island Health region, please be aware of this requirement in park and complete the provided contact tracing form along with your in-park registration and fees. If you are able to complete this in advance or are staying in a campground that is unmaintained, please submit <a href=&rdquo;/covid-19/docs/Campground COVID-19 Contract Tracing Form November 2020.pdf&rdquo; target=&rdquo;_blank&rdquo;>this form</a> to <a href=&rdquo;mailto:BCPContactTrace@gov.bc.ca&rdquo;>BCPContactTrace@gov.bc.ca</a>."},{"AdvisoryID":"259","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-23 2:15:34 PM","Headline":"Please be properly equipped for winter road conditions","Description":"<p>Park users are reminded to be properly equipped for winter driving and road conditions. Roads in the park are not plowed or sanded in the winter.</p> <p>Be prepared for snow and ice. Carrying tire chains is recommended.</p> <p>Winter Tire, chain, and traction device requirements October 1, 2020 &ndash; April 30, 2021:</p> <p><ul><li><a href=&rdquo;https://www2.gov.bc.ca/gov/content/transportation/driving-and-cycling/traveller-information/seasonal/winter-driving/about-winter-tires&rdquo; target=&rdquo;_BLANK&rdquo;>Passenger Vehicle-Tire and Chain Requirements</a></li> <li><a href=&rdquo;https://www2.gov.bc.ca/gov/content/transportation/driving-and-cycling/traveller-information/seasonal/winter-driving/recreational-vehicles&rdquo; target=&rdquo;_BLANK&rdquo;>Recreational Vehicle &Tailer Tire and Chain Requirements</a></li></ul></p> <p><img src=&rdquo;/explore/parkpgs/porteau/images/chains.gif&rdquo; height=&rdquo;100px&rdquo;> <img src=&rdquo;/explore/parkpgs/porteau/images/winter-tires&rdquo; height=&rdquo;100px&rdquo;></p>"},{"AdvisoryID":"258","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-23 11:49:08 AM","Headline":"Caution - Trails and parking lots not maintained during winter","Description":"Trails and parking lots are not maintained in the winter. You may encounter deep snow, ice and slippery conditions. Micro spikes or snowshoes are strongly recommended. Use at your own risk."},{"AdvisoryID":"257","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-23 11:46:57 AM","Headline":"Caution - Icy conditions","Description":"During cold conditions, ice may form. Trail may be slippery. Watch for falling ice and debris."},{"AdvisoryID":"255","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-23 11:16:25 AM","Headline":"Caution - Frozen lakes extremely dangerous","Description":"<p>Frozen lakes are extremely dangerous and ice thickness is NOT monitored. Our recommendation is to stay off the ice.</p> <p>Should you choose to proceed onto the lake this is at your own risk. If you would like to learn more about the dangers of ice, please read this information on <a href=&rdquo;https://www.redcross.ca/training-and-certification/swimming-and-water-safety-tips-and-resources/swimming-boating-and-water-safety-tips/ice-safety&rdquo; target=&rdquo;_BLANK&rdquo;>ice safety</a>.</p>"},{"AdvisoryID":"254","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-20 5:18:57 PM","Headline":"Construction and access notice","Description":"<p>BC Parks will be performing improvements on the Stump Lake parking lots, commencing Nov. 12. The work will last approximately two weeks, and there will be no parking at Stump Lake during that period. Please park in the main day use area by taking the first right on the Alice Lake Road towards Alice Lake, and be aware of the construction equipment when accessing the Four Lakes Trail. </p> <p>For hikers and bikers who would like to use the gravel road beyond Stump Lake lot, please park in the main day use area and hike or bike through the campground. Please stop prior to passing the construction site and ensure that the operator permits you to pass before proceeding. </p> <p>Thank you for your patience and understanding.</p>"},{"AdvisoryID":"248","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-20 2:01:56 PM","Headline":"Park will be inaccessible Nov. 25 to Dec. 20, 2020.","Description":"The Ministry of Forests, Lands, Natural Resource Operations and Rural Development is in the process of providing much needed road work and rehabilitation on the Morton Lake Forest Road accessing Morton Lake Park. Due to heavy equipment on site through this period the road is closed to all traffic."},{"AdvisoryID":"247","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-20 1:49:38 PM","Headline":"Visitor Centre closed and cave tours suspended","Description":"<p>Due to precautions against the spread of the COVID-19 virus, and to ensure the health and safety of parks visitors, volunteers and all employees, the visitor centre has been closed and all cave tours have been suspended until further notice. </p> <p>The public is also advised that the two self-guiding caves, are also closed to the public until further notice.</p>  <p>All trails remain open along with outdoor pit toilet facilities. Maintenance and monitoring of park will continue. We are encouraging people to follow the recommendations of the Provincial Health Officer and the <a href=&rdquo;http://covid-19.bccdc.ca/&rdquo;>BC Centre for Disease Control</a>. Please monitor the this page for further notices. Thank you for your understanding and cooperation.</p>"},{"AdvisoryID":"246","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-19 5:54:22 PM","Headline":"Off-Road Vehicles prohibited in park","Description":"<p>Off-Road Vehicles (ORVs) are prohibited in this park. ORVs include ATVs, off-road motorcycles, snowmobiles and side-by-sides.</p>"},{"AdvisoryID":"245","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-19 5:41:01 PM","Headline":"Bobtail Mountain access road conditions - removed bridge","Description":"<p>        Gregg Creek Forest Service Road is rough with potholes and logging activity; please use caution when traveling the road. Bobtail Mountain Road is in fair condition from the turn off from the Gregg Creek Forest Service Road at 23.5 km to 5 km where <b>the bridge has been removed.</b></p><p> Please note that the removal of the bridge will add 2km to your hike each way. Please park appropriately at this location to allow other users access to the area. Use caution when crossing the creek.  </p>"},{"AdvisoryID":"244","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-19 4:20:25 PM","Headline":"Trail condition in poor shape - Travel not recommended","Description":"<p>Please be advised the trail up to the Holliday Creek Arch is in very bad shape with windfall, washouts and several areas where detours are required. Travel is <strong>not recommended</strong> unless you are prepared for these conditions. </p>"},{"AdvisoryID":"242","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-18 10:00:32 AM","Headline":"The gate to the upper summer parking lot has now been locked and is closed for the winter season","Description":"<p>As the access road leading up to the park is not maintained being prepared and equipped with 4x4, good winter chains, shovel and tow ropes at a minimum is strongly recommended. Whenever possible, please spread vehicle tracks across the road to avoid creating deep ruts. Enjoy the snow. </p>"},{"AdvisoryID":"241","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-13 1:16:08 PM","Headline":"Winter conditions in effect","Description":"<ul>  <li>Winter parking designation in effect.</li>  <li>Check the avalanche conditions at <a href=&rdquo;https://avalanche.ca/&rdquo;>avalanche.ca</a>.</li>  <li>Prepare your vehicle for winter travel.</li> </ul>"},{"AdvisoryID":"240","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-13 1:11:51 PM","Headline":"Winter conditions in effect","Description":"<ul>  <li>Refer to the know before you go section to learn about parking, closures and other information.</li>  <li>Get your Yellow Tag (release of liability) before recreating on the Yew Lake trails and beyond. Yellow tags are available at the Black Mountain Lodge.</li>  <li>Check the avalanche conditions at <a href=&rdquo;https://avalanche.ca/&rdquo;>avalanche.ca</a>.</li>  <li>Prepare your vehicle for winter travel.</li> </ul>"},{"AdvisoryID":"236","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-12 11:16:44 AM","Headline":"Gates closed due to snow","Description":""},{"AdvisoryID":"235","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-11-05 4:44:00 PM","Headline":"Park gates are now closed for the season","Description":"<p>Parking in front of the gates or along highway 99 is prohibited and vehicles will be towed at owners expense. </p>"},{"AdvisoryID":"233","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-30 3:40:20 PM","Headline":"Snowmobile use no longer permitted in any area of Elk Lakes Park","Description":"The previous special exemption to use snowmobiles to access Abruzzi Lake along the seismic corridor is no longer in effect. The entire park is closed to all motorized activities. Non-compliance of the motorized closure will result in enforcement actions."},{"AdvisoryID":"225","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-23 1:51:21 PM","Headline":"Bridge removal project complete","Description":"Bridge removal on multi-use trail near Mt. Sullivan is now complete. The trail will remain closed until the end of November when the new pedestrian crossing will be in place. Please note that the park boundary is approximately 200m east of the crossing near the CRD Waste Water Treatment plant."},{"AdvisoryID":"224","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-22 11:53:24 AM","Headline":"Boat launch closed to public","Description":"<p>Lac Le Jeune boat launch is closed to public use due to construction activities.</p><p><b>Duration closed: Monday, October 26 &ndash; Friday, October 30, 2020</b></p><p>Well drilling equipment will be working near the boat launch and pumphouse blocking off access during this time period. This closure is only temporary while drilling activities take place. Thank you for you patience while we endeavour to improve our service facilities at the Park. </p>"},{"AdvisoryID":"221","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-20 12:38:38 PM","Headline":"Parking lot closed for the remainder of the 2020 season","Description":"<p>Due to recent theft and vandalism events that have occurred in the park, the parking lot will be closed for the remainder of the 2020 season.</p> <p> The park remains open and can still be accessed on foot.</p>"},{"AdvisoryID":"219","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-19","Headline":"Notice of temporary trail closure","Description":"<p>The Morden Colliery Regional Trail and all of Morden Colliery Historic Provincial Park will be closed for five days while BC Parks removes the containers used to stabilize the tipple structure, situated beside the parking lot serving the Provincial Park and Regional Trail.</P> <p>When:  Monday, November 16 &ndash; Friday, November 20, 2020<br>      7 am to 7 pm</p>"},{"AdvisoryID":"218","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-16 11:45:51 AM","Headline":"Blackwall Road and Lone Duck 1 Shelter winter closures","Description":"<p>Blackwall Road to the Cascade Lookout and Alpine Meadows is now closed for the season to vehicle traffic due to snow.</p> <p>Lone Duck 1 shared winter shelter will not be open this year due to COVID-19.</p>"},{"AdvisoryID":"217","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-15 11:55:45 AM","Headline":"Campground and park gate closed for the winter","Description":"<p>Rolley Lake Campground and park main gate are closed for the winter. No vehicle access to park, but foot traffic is welcome. Overnight camping is not permitted. Winter camping is available nearby at <a href=&rdquo;http://bcparks.ca/explore/parkpgs/golden_ears/&rdquo; target=&rdquo;_BLANK&rdquo;>Golden Ears Provincial Park</a>. </p><p>Rolley Lake Campground and main gate will reopen on April 1, 2021. <br><a href=&rdquo;#operating-dates&rdquo;>See dates of operation</a>.</p>"},{"AdvisoryID":"216","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-15 11:31:16 AM","Headline":"Golden Ears Provincial Park winter hours","Description":"Golden Ears Provincial Park is now operating on winter hours. The park gate is open 8am - 5:30pm daily, please exit the park by 5:30pm. If hazardous road conditions exist (snow/ice on road), the park gate will remain closed all day. Winter camping is available at Gold Creek Campground when the park road is open. <br><a href=&rdquo;#operating-dates&rdquo;>See dates of operation</a>. For updates on road conditions and closures, visit the Park Operator&rsquo;s Twitter feed <a href=&rdquo;https://twitter.com/AlouetteParks&rdquo; target=&rdquo;_BLANK&rdquo;>@alouetteparks</a>"},{"AdvisoryID":"215","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-14 4:23:40 PM","Headline":"Tote Road and Stillwater Lake Trail Conditions Update","Description":"<p>Due to 2017 wildfire activity, significant flood risk hazard and debris flow hazard exists at drainages along the Tote Rd. Park visitors should avoid travelling on the Tote Rd during high water or rain events.</p> <p>Due to rockfall on the Tote Road, it is driveable only by 4x4 high clearance vehicles with narrow wheelbase.</p> <p>Stillwater lake trail is open.</p>"},{"AdvisoryID":"213","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-13 4:07:58 PM","Headline":"Expect winter snow conditions all across Garibaldi Park","Description":""},{"AdvisoryID":"211","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-09 4:56:31 PM","Headline":"Traffic pattern change at Manson&rsquo;s Landing Oct. 16, 2020","Description":"<p>In order to protect the sensitive coastal sands ecosystems at Manson&rsquo;s Landing Park, the rock barriers that prevent vehicle access to the spit will be relocated. The barriers will be moved approximately, 80m South toward the boat launch turn around area . Please use the boat launch with care. Assist restoration efforts by parking vehicles and trailers in the parking area opposite the government dock, once you have finished launching your boat. </p> <p>The rock barriers will be relocated on October 16, 2020. Please note, boat launch access will be limited while the work is being completed. Thank-you for your cooperation.</p>"},{"AdvisoryID":"210","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-10-09 4:17:01 PM","Headline":"Day-use passes are not required to visit the park at this time","Description":""},{"AdvisoryID":"209","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-10-09 11:26:28 AM","Headline":"Picnic Shelter remains closed for the season","Description":""},{"AdvisoryID":"201","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-25 12:05:39 PM","Headline":"Construction is underway for the Trans Mountain Expansion Project - please obey all posted signs and closures","Description":""},{"AdvisoryID":"198","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-22 9:08:51 AM","Headline":"A cougar has been observed near the Timberman Trail","Description":"Be cougar smart and keep your pets on leash."},{"AdvisoryID":"197","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-09-21 10:58:36 AM","Headline":"Vehicle use in Chemainus River Park is restricted to Hillcrest Road (Forest Service Road)","Description":"Driving on park trails disrupts and damages natural areas. Operators of vehicles found off-road may be fined under the <a href=&rdquo;http://www.bclaws.ca/civix/document/id/complete/statreg/180_90_00&rdquo;>Park, Conservancy and Recreation Area Regulation</a> (minimum $575, maximum $200,000)."},{"AdvisoryID":"196","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-09-21 10:57:42 AM","Headline":"Off-road vehicle registration is mandatory","Description":"Starting in 2015, off-road vehicle registration is mandatory on crown land, including on forest service roads. Find out more at: <a href=&rdquo;https://www2.gov.bc.ca/gov/content/industry/crown-land-water/crown-land/crown-land-uses/off-road-vehicles&rdquo;>Off-Road Vehicle Management Framework</a>."},{"AdvisoryID":"195","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-09-21 10:56:47 AM","Headline":"No camping or campfires are permitted in this park at any time","Description":""},{"AdvisoryID":"190","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-16 11:46:50 AM","Headline":"Picnic shelter closed until further notice","Description":""},{"AdvisoryID":"188","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-16","Headline":"Sea to Summit Trail closed until further notice. Thank you for your understanding","Description":"The Backside trail has been cleared by the RCMP, but Sea to Summit will not be opened for the foreseeable future."},{"AdvisoryID":"187","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-15 3:48:04 PM","Headline":"Halloween event postponed","Description":"This year&rsquo;s Halloween event, scheduled for the Thanksgiving weekend, will be postponed until next year.  We are taking every precaution regarding COVID 19 and given the clear guidelines of safe social distancing, we are not in a position to safely operate the event this year.  While we understand this will be disappointing to many, we thank you in advance for your understanding and patience. We look forward to the event being scheduled next year!"},{"AdvisoryID":"186","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-15 3:43:34 PM","Headline":"Boat launch closed until further notice","Description":"Due to low water levels and the potential for visitors to damage their vehicles and equipment the public boat Launch at Shuswap Lake Provincial Park is closed until further notice.  Please monitor this webpage for future updates."},{"AdvisoryID":"184","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-15 11:31:08 AM","Headline":"Active bear in area","Description":"An adult black bear is active throughout the park, including the Backside Trail, Campground and climbing areas. Please be bear aware and secure all attractants in your vehicle when in the park If you encounter the bear, please report it to the RAPP line: 1-877-952-7277"},{"AdvisoryID":"182","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-14 4:30:07 PM","Headline":"Bear Advisory &ndash; updated September 14, 2020 and ongoing","Description":"<p>BC Parks has received ongoing reports of bear observations in San Josef Bay Area and along the North Coast Trail. <strong>All visitors and hikers in Cape Scott must be extremely mindful about how they recreate in bear habitat to help prevent bears from becoming habituated to humans and conditioned to insecure attractants. </strong></p> <p><strong>Please do your part when recreating in bear country and help keep bears wild.</strong></p> <ul> <li><a href=&rdquo;http://bcparks.ca/explore/wild_gen.html&rdquo;>More about wildlife safety</a></li> <li><a href=&rdquo;http://bcparks.ca/recreation/water_ethics.html&rdquo;>More about backcountry etiquette</a></li> </ul> <p><strong>If you encounter an aggressive wild animal, report it by calling the Conservation Officer Service 24-hour hotline toll free at <a href=&rdquo;tel://+1-877-952-7277/&rdquo;>1-877-952-7277 (RAPP)</a> or #7277 on the Telus Mobility Network.</strong></p>"},{"AdvisoryID":"180","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-11 4:37:54 PM","Headline":"Log jam on Gitnadoiks River","Description":"There is a log jam on the Gitnadoiks River, 500 meters upstream from the PNG line that impedes travel. The log jam is at a bend in the river where turning around is difficult. We do not recommend travelling up the Gitnadoiks River at this time. <p> <img class=&rdquo;photo&rdquo; src=&rdquo;log-jam-20200911.jpg&rdquo; style=&rdquo;max-width: 400px&rdquo; alt=&rdquo;Log jam&rdquo; title=&rdquo;Log jam&rdquo;></p>"},{"AdvisoryID":"178","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-09-11 4:22:06 PM","Headline":"Park re-opening details","Description":"<p>Picnic area open for day-use as of May 14, 2020 &ndash; Picnic shelter remains closed, no water or flush toilets available, not all services will be available.</p> <p>Furlong Bay open for camping and day-use as of June 1, 2020 &ndash; Picnic shelter and amphitheatre remain closed.</p>"},{"AdvisoryID":"177","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-09-11 2:32:34 PM","Headline":"The 2020 camping season has been extended at this park - see Dates of Operation table below","Description":""},{"AdvisoryID":"176","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-09-09 1:59:59 PM","Headline":"We appreciate your feeback!","Description":"If you have visited Big Creek Provincial Park, we would appreciate if you could <strong>please complete an <a href=&rdquo;park_user_comments_form.html&rdquo;>online comment form</a></strong>. This will allow park managers to obtain valuable information from those who have experienced the area. This form is not for providing input to the management planning process."},{"AdvisoryID":"174","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-08 2:54:26 PM","Headline":"Caution: Due to historic military training exercises in the Cosens Bay area, Unexploded Ordinance (UXOs) may be present","Description":"Please stay on designated trails at all times. If a UXO is encountered, <strong>do not touch it and call 911.</strong>"},{"AdvisoryID":"171","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-08 11:15:01 AM","Headline":"The Nels Bight and Cape Sutil Ranger Station Cabins will be closed to public access until further notice","Description":"Campers must be self-sufficient and prepared to camp at all locations within the park. Thank you for your cooperation."},{"AdvisoryID":"170","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-09-08 11:03:55 AM","Headline":"Due to demand, as of 2017, all sites in McDonald Creek Campground are reservable from June 21 &ndash; September 12, 2020","Description":"During this period, non-occupied reservation sites can accommodate first-come, first-served customers for one, or perhaps more nights, depending on availability."},{"AdvisoryID":"167","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-04 10:43:27 AM","Headline":"Surveyor&rsquo;s Lake Campground closed on September 15 for the remainder of the season","Description":"<p>BC Parks will be closing Surveyor&rsquo;s Lake Campground on September 15, 2020 for the remainder of the season, in order to complete facility upgrades. The project will include resurfacing each campsite and replacing the picnic tables, fire rings and number posts. Park visitors should be aware that heavy equipment will be transitioning through the park and working in Surveyor&rsquo;s Lake Campground.</p><p>Camping opportunities will continue to be available in Kalispell and Ponderosa Campgrounds until September 30, 2020.</p>"},{"AdvisoryID":"166","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-03 4:52:10 PM","Headline":"Road Closures","Description":"<p>The Clearwater River Road (the gravel road along the west side of the Clearwater River, used primarily by fishers and kayakers) is closed beyond the Kettle at 9km, due to water damage. Updates will be provided as conditions change but the road may be inaccessible beyond the Kettle for some time.</p>"},{"AdvisoryID":"165","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-02 10:59:44 AM","Headline":"Gwe Da Ts&rsquo;ih Campground closing September 15","Description":"Gwe Da Ts&rsquo;ih Campground will be closed as of September 15th 2020, to prevent human-bear interactions this fall."},{"AdvisoryID":"164","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-02 10:40:17 AM","Headline":"Kennedy Lake Park is a day-use park","Description":"<p><strong>Camping and overnight parking is strictly prohibited.</strong></p><p>Anyone found in the park between 11pm and 7am will be evicted and will receive violation tickets.</p>"},{"AdvisoryID":"163","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-09-02 9:51:18 AM","Headline":"Illegally parked vehicles","Description":"<p><strong>Starting September 5, 2020, vehicles parked illegally at Porteau Cove Park will be subject to towing at the owner&rsquo;s expense. Visitors must park in designated parking lots and observe the &ldquo;no parking&rdquo; signs posted.</p><p>Illegal parking has become a safety issue at Porteau Cove Park, with vehicles blocking access for emergency response and people parking along the highway. Thank you for making a visit to Porteau Cove safe for everyone.</strong></p>"},{"AdvisoryID":"162","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-31 3:49:07 PM","Headline":"Buckhorn campground closed beginning September 8, 2020","Description":"Buckhorn campground will be closed on September 8th for the remainder of the season to upgrade and expand facilities for the 2021 camping season. The Heather trail will remain open during this time, however hikers may be asked to briefly stop while traveling through the area of Buckhorn camp. The upper parking area at the sub-alpine meadows will be closed from September 8th-11th to allow for storage of materials for this project."},{"AdvisoryID":"158","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-28 9:33:19 AM","Headline":"No parking on Alice Lake Road","Description":"In order to maintain park safety and public security, all vehicles parked illegally and on road edges will be subject to towing at the owner&rsquo;s expense."},{"AdvisoryID":"157","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-27 3:01:54 PM","Headline":"Running water unavailable at Shelter Bay Site","Description":"Due to a waterline break, the Shelter Bay Site is currently without running water. Updates will be posted when available."},{"AdvisoryID":"156","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-27 2:55:39 PM","Headline":"Cowichan Valley Trail (Trans Canada Trail) closed","Description":"The Ministry of Transportation and Infrastructure has closed the Cowichan Valley Trail between Holt Creek Trestle and 66 Mile Trestle. Repairs to the trestles and trail washouts are anticipated to complete in mid-October 2020. Please note during this time, the Cowichan River Footpath in the area of the repairs may be impacted/closed for the work. <ul><li><a href=&rdquo;https://news.gov.bc.ca/releases/2020TRAN0126-001546&rdquo;>Information Bulletin</a></li></ul>"},{"AdvisoryID":"155","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-27 8:53:31 AM","Headline":"Trail and recreational access closures this fall","Description":"<p> Trail and recreational access closures this fall </p> <p> Please be advised that BC Parks will be conducting three fuel management projects in West Arm Park this fall (September to December). To ensure public safety during these treatments, there will be trail closures and recreational access closures associated with all three projects. </p> <ol start=&rdquo;1&rdquo; type=&rdquo;1&rdquo;> <li> 12.7 hectare hand treatment 1km up Svoboda Road in the vicinity of Short Svoboda, Frog Jam, Squeeler, and Toe Jam Trails. Expect trail closures from September 8th until late November or early December. Please also see trail information on the Nelson Cycling Club&rsquo;s Facebook page. </li> <li> 12.7 hectare hand treatment along Lasca Road. There will be no recreational access beyond the gate as of September 1st until late November or early December. </li> <li> 15.4 hectare mechanical treatment at the end of Lasca Road. There will be no recreational access beyond the gate as of September 1st until late November or early December. </li> </ol> <p> Please obey all informational signage posted on site and please check this website often for the latest updates. </p> <p> For more information please call 250 489-9211. </p>"},{"AdvisoryID":"154","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-27 8:44:54 AM","Headline":"Recreation trails between the campgrounds are closed","Description":"A slump in the silt bluff between the campgrounds at Okanagan Lake Park have closed the recreation trails between them. It is likely that the trails will remain closed at minimum for the remainder of 2020."},{"AdvisoryID":"153","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-08-26 4:48:34 PM","Headline":"Porcupine Advisory","Description":"If leaving your vehicle at the trail head, we suggest that you surround your vehicle with chicken wire. Porcupines may chew on brake and fuel lines."},{"AdvisoryID":"151","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-25 10:02:17 AM","Headline":"Park closed beginning in September for facility upgrades","Description":"BC Parks will be closing Bijoux falls for September and possibly October for upgrades to the Faculties. Please plan your trip accordingly as public access will not be allowed to the Falls during this time. Thank you for your cooperation."},{"AdvisoryID":"145","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-18 8:59:03 AM","Headline":"Hind Hut Closure","Description":"<p>The Hind Hut is currently closed due to COVID-19. Hikers and climbers will need to plan and prepare accordingly. Camping is available by reservation only within the core area of the park.  Please visit BC Parks reservation site at: <a href=&rdquo;https://www.discovercamping.ca/&rdquo;>discovercamping.ca</a> for more information.</p>"},{"AdvisoryID":"142","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-17 3:59:23 PM","Headline":"Hamill Creek Trail closed at 3<sup>rd</sup> cable car crossing","Description":"Hamill Creek Trail closed at 3<sup>rd</sup> cable car crossing due to hazard trees within the area."},{"AdvisoryID":"141","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-17 2:51:30 PM","Headline":"Boiling water advisory at Hicks Lake","Description":"Visitors are advised to boil water for at least two minute before drinking."},{"AdvisoryID":"140","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-17 2:46:50 PM","Headline":"Washroom buildings at Honeymoon Bay group campsite are unavailable until further notice","Description":"Thank you for your patience."},{"AdvisoryID":"136","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-12 4:24:29 PM","Headline":"The Washout Creek and Fortress Creek Campgrounds have been decommissioned due to dangerous trees","Description":"Please use at your own risk."},{"AdvisoryID":"134","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-08-12 4:18:52 PM","Headline":"Fording the Athabasca River is not recommended","Description":"There is no estimated time for repair or replacement of this bridge."},{"AdvisoryID":"133","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-12 10:52:31 AM","Headline":"Phase 3 of the restoration project has begun","Description":"<p>Restoration (Phase 3) of the historic concrete tipple has started. Due to the movement of machinery, please exercise caution when accessing the park and obey all signage.</p>"},{"AdvisoryID":"130","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-11 4:35:01 PM","Headline":"New campsites and accessibility improvements at Loveland Bay Provincial Park","Description":"<p>  In response to public demand for increased camping opportunities in highly desirable locations, the Provincial Government has invested $22.9 million in campgrounds throughout British Columbia over the last five years. </p> <p>  This includes new campsites at Loveland Bay Provincial Park. Over the next year, 22 additional campsites will be added to meet increased demand. This project will also include upgrades to the existing campsites, a reconstructed beach area, new toilet facilities, expanded parking and improved accessibility to visitors. In addition, improvements to the campground road will result in better passage for fish and amphibians. </p> <ul>  <li>   <a href=&rdquo;docs/loveland-bay-campground-expansion-sign-2020.pdf&rdquo; target=&rdquo;_blank&rdquo;>Loveland Bay Campground Expansion Sign <span class=&rdquo;fileinfo&rdquo;>[PDF]</span></a>  </li> </ul>"},{"AdvisoryID":"128","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-11 9:04:29 AM","Headline":"Green Lake sani-station closed","Description":"The sani-station/dump facilities located at the junction of North Green Lake Road and North Bonaparte Road are closed for repairs."},{"AdvisoryID":"125","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-07 4:46:22 PM","Headline":"The campground will be closed for the season effective September 9 for electrification construction","Description":""},{"AdvisoryID":"124","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-07 1:14:31 PM","Headline":"Conrad Kain Hut availability","Description":"<p>The Conrad Kain hut is only available for reserved guests with the Alpine Club of Canada under strict COVID-19 protocols.</p>"},{"AdvisoryID":"123","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-08-07 1:11:32 PM","Headline":"Peregrine Falcons in South Gully/Memorial Ledge/Squamish Buttress Area of Stawamus Chief","Description":"Use caution in these areas and areas in and around the Apron. If you encounter a falcon, keep your distance. If the birds appear agitated, leave the area as soon as possible."},{"AdvisoryID":"120","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-08-06 1:38:41 PM","Headline":"Campfires are not permitted in this park","Description":""},{"AdvisoryID":"119","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-08-06 8:47:26 AM","Headline":"White-Nose Syndrome","Description":"White-nose Syndrome is a fungal disease that has been linked to the mass die-off of hibernating bats in Eastern North America &ndash; it poses a significant threat to bats of the west and British Columbia. There is evidence that humans have accelerated the spread through entering caves with contaminated clothing, gear or equipment. To help prevent WNS from taking hold in B.C., the Province is making investments in bat conservation projects. <p><strong> To ensure the protection of bats and their habitat in this park, BC Parks strongly advises that personal caving gear that has been used anywhere east of the Rockies not be used in B.C. Also, before entering caves in B.C, cavers and visitors should consult the provincial WNS website, which includes a link to a Decontamination Protocol for Mines and Caves. </strong></p> <ul><li><a href=&rdquo;http://www2.gov.bc.ca/gov/content/environment/plants-animals-ecosystems/wildlife/wildlife-health/wildlife-diseases/white-nose-syndrome&rdquo;>Learn more about white-nose syndrome</a></li></ul>"},{"AdvisoryID":"116","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-05 4:33:47 PM","Headline":"Tweedsmuir Provincial Park frontcountry is only accepting first-come, first-served camping at this time","Description":""},{"AdvisoryID":"112","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-08-04 9:37:08 AM","Headline":"Road and Trail Information","Description":"<p>NOTICE OF INTERMITTENT ROAD CLOSURE - The Walker FSR will have intermittent delays for repairs scheduled to be completed on the Fraser River Bridge (G1-710), located at 5.3 Km. Work is scheduled to commence on August 17th, and will last approximately 7 days.</p> <p> While travelling on the Walker Creek Forest Service Road (FSR), attention is required to navigate the surface as it is uneven, rutted, slippery and very rough. The road is not recommended for anything other than a 4x4, high clearance vehicle, and drivers familiar with this type of vehicle operation.</p> <p> The trail between Bastille Creek and Buchanan Creek can result in quite a bit of hiking around sections where the old road surface has washed away and some travel on muddy sections of the winter snowmobile route due to ATV/UTV traffic and wet conditions up to Buchanan Creek where ATV/UTV traffic is not permitted within the boundaries of the Park. Trail/route surface is a good hard surface from Buchanan Creek to Kakwa Lake.</p>"},{"AdvisoryID":"108","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-31 4:30:39 PM","Headline":"New cabin construction at Ozalenka","Description":"Please be advised that construction of a new cabin will be happening around the Ozalenka campground/cabin site from July 29, 2020-October 30, 2020. There may be helicopter and construction noise in the area during this time, we apologize for any inconvenience."},{"AdvisoryID":"107","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-31 3:23:27 PM","Headline":"Campground capacity reduction due to danger trees","Description":"Campground size is reduced to one campsite due to hazard trees from a pine beetle infestation 5-10 years ago. Standing dead pine trees surrounding the campground are becoming unstable and hazardous as roots decay. The boat launch and one campsite have been cleared of hazard trees and are now open to public. Please respect signage and stay out of areas that remain closed. Visitors planning to camp overnight are asked to limit the length of their stay, and advised to make back-up plans since the campground is likely to be full."},{"AdvisoryID":"106","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-31 12:11:00 PM","Headline":"Trail map update","Description":"BC Parks has recently updated the Burgoyne Bay trail map to reflect some changes. Please be advised that the gravel road adjacent to the eastern boundary of Burgoyne Bay Provincial Park is a private driveway and is not part of the trail network. BC Parks has decommissioned a 400m section of trail that led to the private driveway."},{"AdvisoryID":"97","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-30 12:04:11 PM","Headline":"Shower building at Clearwater Lake Campground closed for the season","Description":"Park Visitors to Clearwater and Falls Creek campgrounds in Wells Gray Provincial Park are advised that the shower facility normally operated in the concession building is closed for the season."},{"AdvisoryID":"96","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-30 12:02:28 PM","Headline":"Drinking water at Mahood Lake campground on permanent boil water order","Description":"Park Visitors are advised to either bring their own potable water or boil water prior to consumption. Interior Health advises the following: <ul> <li>Boiling water is the most effective way to disinfect water, particularly if you think your water has parasites such as Giardia or Cryptosporidium, or if you have a weakened immune system. </li> <li>Boil water for at least 1 minute. At elevations over 2,000 meters (6,500 feet) boil water for at least 2 minutes.</li> <li>Store disinfected water in clean, covered, food grade containers </li> </ul> BC Parks is working with Interior Health and our Capital program and hopes to develop a new drinking water source at the Park in the near future. Unfortunately this will take some time. Please consult this web page for future updates."},{"AdvisoryID":"104","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-07-30 11:18:01 AM","Headline":"Camping is permitted in designated areas only","Description":"<a href=&rdquo;#Reservations&rdquo;>Camping</a> is prohibited along the lakeshore and foreshore areas as well as in the Niobe meadows."},{"AdvisoryID":"103","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2020-07-30 11:16:41 AM","Headline":"Bear-proof canisters are mandatory","Description":"Due to the current popularity of the area, food storage is limited and only available at the main campground. Visitors must store their food in a bear proof canister away from their tent."},{"AdvisoryID":"87","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-27 3:51:27 PM","Headline":"The sani-station located in the Atnarko Corridor is out of order until further notice","Description":"Park visitors should prepare to deal with their waste disposal before and/or after leaving Tweedsmuir Park South."},{"AdvisoryID":"86","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-27 1:59:55 PM","Headline":"Tote Road is currently not accessible past Hwy 20","Description":"Please refer to this page for updates on when the Tote Road will be re-opened."},{"AdvisoryID":"110","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-24 4:51:26 PM","Headline":"Atnarko Corridor sani-station out of order","Description":"The sani-station located in the Atnarko Corridor is out of order until further notice due to unresolved well pump and underground line issues. While we are working to resolve this problem, park visitors should prepare to deal with their waste disposal before and/or after leaving Tweedsmuir Park South."},{"AdvisoryID":"82","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-24 10:35:56 AM","Headline":"For summer 2020, reservations for Garibaldi can be made two weeks in advance","Description":""},{"AdvisoryID":"84","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-24","Headline":"Backcountry camping reservations will be available on <a href=&rdquo;https://www.discovercamping.ca/BCCWeb/Memberships/CustomerOverNightMemberships.aspx&rdquo;>Discover Camping</a> on July 27th @ 7AM (PST).","Description":""},{"AdvisoryID":"81","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-23 5:03:27 PM","Headline":"Capital project occurring at Fish Lake throughout the month of July","Description":"There is a capital project occurring at Fish Lake until August 15th to improve park facilities in this area. Camping will be limited throughout this month due to construction crews using the facilities. Construction noise will be apparent during all calendar days until August 15th. There will be heavy helicopter traffic on July 25th."},{"AdvisoryID":"80","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-23 4:53:35 PM","Headline":"Brushing will be conducted on the Radium Lake Trail July 24 &ndash; 25, 2020","Description":"Please allow crews space to work. Minor delays should be expected."},{"AdvisoryID":"79","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-23 4:24:37 PM","Headline":"Due to high volume, first-come, first-served sites are at 100% occupancy daily","Description":"Please be advised that there may not be a site available when you arrive at the park."},{"AdvisoryID":"78","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-23 3:53:25 PM","Headline":"Flooding on the Bowron Lake Canoe Circuit","Description":"There is currently significant flooding on the Bowron Lake Canoe Circuit and visitors should be aware that some camping areas may not currently be accessible. Canoers should be prepared to canoe an extended distance should their preferred area be experiencing flooding. The east side of the circuit remains closed until at least August 3, inclusive. It is tentatively planned to open on August 4 with the possibility that a closure extension may be required."},{"AdvisoryID":"77","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-23 10:14:52 AM","Headline":"Raven Lake Cabin, Grizzly Den Cabin and 8-Mile Cabin are currently closed","Description":""},{"AdvisoryID":"76","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 3:21:18 PM","Headline":"Sombrio Beach Access Road Construction","Description":"Please be advised that bank stabilization works will be occurring Tuesday, July 28 &ndash; Friday, July 31, 2020. Expect traffic delays of up to 20 minutes. Flaggers will be onsite during works, directing traffic. Drive with care."},{"AdvisoryID":"75","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 2:51:37 PM","Headline":"Buckhorn Campground will be closed on September 8th for the remainder of the season to upgrade and expand facilities for the 2021 camping season","Description":"The Heather trail will remain open during this time, however hikers may be asked to briefly stop while travelling through the area of Buckhorn camp."},{"AdvisoryID":"74","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 2:43:20 PM","Headline":"Trail User Advisory","Description":"<p>Canyon View Trail will have short term closures and trail detours in place over the next 3 weeks to accommodate trail maintenance activities and salmon spawning gravel placement work in the Campbell River.</p> <p>Thank you for your cooperation.</p>"},{"AdvisoryID":"73","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 2:41:33 PM","Headline":"Canyon View Trail Detour July 27 &ndash; 31","Description":"<h6>Lower Canyon View Trail &ndash; North side of river (closed at logging road bridge)</h6> <p>  This location will be inaccessible due to trail and boardwalk upgrading in the area. Trail users may continue to access the trail via the Logging road and the Pumphouse access road <br>  Please see map attached. </p> <ul>  <li>   <a href=&rdquo;docs/Canyon-View-Trail-Detour-Signs-2020.pdf&rdquo; target=&rdquo;_blank&rdquo;>Canyon View Trail Detour</a>  </li> </ul>"},{"AdvisoryID":"72","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 2:16:32 PM","Headline":"Chinook Spawning Gravel Placement Project August 4 &ndash; 15","Description":"<h6>Lower Canyon View Trail &ndash; North side of river (upstream of the Pumphouse)</h6> <p>This location will be subject to short trail delays while heavy equipment mobilizes spawning gravel to the river. </p> <p>   Please adhere to on-site closures and flagging personnel and watch for heavy equipment. Project description and map attached.</p> <ul>  <li>   <a href=&rdquo;docs/2020-Chinook-Gravel-Project-Info.pdf&rdquo; target=&rdquo;_blank&rdquo;>2020 Chinook Advisory</a>  </li> </ul>"},{"AdvisoryID":"71","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 11:06:38 AM","Headline":"New day-use reservation system","Description":"<p>  As of July 27<sup>th</sup>, a new day-use reservation system is in effect for day-use access in Golden Ears Park. Please obtain a pass for the following day-use destinations: the South Beach day-use area parking lot, the Alouette Lake boat launch parking (for boat trailers), West Canyon Trailhead parking lot and the East Canyon and North Beach parking lot. </p> <p>  You can obtain a pass on the <a href=&rdquo;https://discovercamping.ca/BCCWeb/Memberships/MembershipPasses.aspx&rdquo;>Discover Camping website</a>. Passes are available starting at 6AM for a same day visit. Please have your pass ready for review by the Park Operator staff at the checkpoint on the main access road. </p> <p>  Vehicles that arrive at the checkpoint without a day-use pass or a camping reservation will be asked to turn around and return with a valid pass or reservation. </p> <p>  Please note: Passes do not guarantee a parking spot. Visitors should plan accordingly. </p> <ul>  <li>   <a href=&rdquo;/reserve/day-use/&rdquo;>Day-Use Pass Information</a>  </li> </ul>"},{"AdvisoryID":"70","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 11:02:09 AM","Headline":"New day-use reservation system","Description":"<p>  As of July 27<sup>th</sup>, a new day-use reservation system is in effect for day-use access to the following trailheads in Garibaldi Park: Diamond Head (Elfin Lakes), Rubble Creek (Garibaldi Lake), and Cheakamus. </p> <p>  You can obtain a pass on the <a href=&rdquo;https://discovercamping.ca/BCCWeb/Memberships/MembershipPasses.aspx&rdquo;>Discover Camping website</a>. Passes are available starting at 6AM for a same day visit. Please have your pass ready for review by the Park Operator staff. </p> <p>  Please note: Passes do not guarantee a parking spot. Visitors should plan accordingly. </p> <ul>  <li>   <a href=&rdquo;/reserve/day-use/&rdquo;>Day-Use Pass Information</a>  </li> </ul>"},{"AdvisoryID":"69","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 11:00:20 AM","Headline":"New day-use reservation system","Description":"<p>  As of July 27<sup>th</sup>, a new day-use reservation system is in effect for day-use access to the upper mountain trails (Seymour Main Trail, Mystery Lake trail, Dog Mountain Trail). </p> <p>  You can obtain a pass on the <a href=&rdquo;https://discovercamping.ca/BCCWeb/Memberships/MembershipPasses.aspx&rdquo;>Discover Camping website</a>. Passes are available starting at 6AM for a same day visit. Please have your pass ready for review by the Park Operator staff at the trailhead. </p> <p>  Please note: Passes do not guarantee a parking spot. Visitors should plan accordingly. </p> <ul>  <li>   <a href=&rdquo;/reserve/day-use/&rdquo;>Day-Use Pass Information</a>  </li> </ul>"},{"AdvisoryID":"68","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 10:57:09 AM","Headline":"New day-use reservation system","Description":"<p>  As of July 27<sup>th</sup>, a new day-use reservation system is in effect for day-use access to the upper mountain trails in Cypress Park including the Howe Sound Crest Trail, Hollyburn Mountain trail, and the Black Mountain Plateau trail. </p> <p>  You can obtain a pass on the <a href=&rdquo;https://discovercamping.ca/BCCWeb/Memberships/MembershipPasses.aspx&rdquo;>Discover Camping website</a>. Passes are available starting at 6AM for a same day visit. Please have your pass ready for review by Park Operator staff at the trailheads. </p> <p>  Please note: Passes do not guarantee a parking spot. Visitors should plan accordingly. </p> <ul>  <li>   <a href=&rdquo;/reserve/day-use/&rdquo;>Day-Use Pass Information</a>  </li> </ul>"},{"AdvisoryID":"67","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-22 10:38:50 AM","Headline":"New day-use reservation system","Description":"<p>As of July 27<sup>th</sup>, a new day-use reservation system is in effect for day-use access to the Chief Peaks Trail (also called the &rdquo;Backside Trail&rdquo;).</p> <p>  You can obtain a pass on the <a href=&rdquo;https://discovercamping.ca/BCCWeb/Memberships/MembershipPasses.aspx&rdquo;>Discover Camping website</a>. Passes are available starting at 6AM for a same day visit. Please have your pass ready for review by Park Operator staff at the trailhead. </p> <p>  Please note: Passes do not guarantee a parking spot. Visitors should plan accordingly. </p> <ul>  <li>   <a href=&rdquo;/reserve/day-use/&rdquo;>Day-Use Pass Information</a>  </li> </ul>"},{"AdvisoryID":"65","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-21 11:33:52 AM","Headline":"Playground construction and trail upgrades are scheduled to start August 4 and continue through to August 21","Description":"Expect disruption and some noise disturbance in the campground during this time. We appreciate your patience."},{"AdvisoryID":"64","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-21 11:20:38 AM","Headline":"Stargazing and Aurora Borealis viewing is becoming increasingly popular at Porteau Cove","Description":"Please note that the park is closed from 11 PM to 7 AM and stargazers must vacate the park between these hours."},{"AdvisoryID":"60","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-21 10:00:59 AM","Headline":"Caution: Extreme danger due to high water","Description":"The water level is extremely high and the <strong>creek crossings are extremely dangerous</strong> at this time. Crossing the creek is not recommended."},{"AdvisoryID":"57","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-16 3:23:42 PM","Headline":"Notice of changes to camping at Smelt Bay","Description":"<ul><li>Camping is by 100% reservation, on.</li> <li>First-come, first-served campsites are not available.</li> <li>Due to COVID-19, overflow is very limited at this location to ensure safe spacing between sites.</li></ul>"},{"AdvisoryID":"56","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-16 3:00:15 PM","Headline":"Please note that significant concerns around a localized outbreak of COVID-19 exist in the remote northern communities","Description":"Visitors to Chase Provincial Park are asked to access the park from the south end via the Finlay-Osilinka Forest Service Road and refrain from entering any indigenous communities."},{"AdvisoryID":"55","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-16 2:16:48 PM","Headline":"This park is closed and visitors to the area are asked to refrain from entering the community","Description":"<strong>Please note that significant concerns around a localized outbreak of COVID-19 exist in the remote northern community of Kwadacha Village (Fort Ware).</strong><p>Services such as fuel and food supplies are not available to the general public. BC Parks appreciates the public&rsquo;s cooperation in following the request of the communities and keeping members safe during these challenging times.</p>"},{"AdvisoryID":"54","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-16 2:02:08 PM","Headline":"This park is closed and visitors to the area are asked to refrain from entering the community","Description":"<strong>Please note that significant concerns around a localized outbreak of COVID-19 exist in the remote northern community of Tsay Keh Dene.</strong><p>Services such as fuel and food supplies are not available to the general public. BC Parks appreciates the public&rsquo;s cooperation in following the request of the communities and keeping members safe during these challenging times.</p>"},{"AdvisoryID":"53","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-16 11:57:52 AM","Headline":"Visitors to this [pType] are asked to refrain from entering either community or mooring boats at the dock","Description":"Please note that significant concerns around a localized outbreak of COVID-19 exist in the remote coastal communities of Lax Kw&rsquo;alaams and Metlakatla. BC Parks appreciates the public&rsquo;s cooperation in following the request of the communities and keeping members safe during these challenging times."},{"AdvisoryID":"50","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-15 10:55:04 AM","Headline":"Canyonlands Trail Bridge Damage","Description":"Due to damage from high water, the bridges over Trout Creek and Hemp Creek have been washed away. The rivers are impassible during normal flows. These bridges are normally accessed from the Flatiron Trail but may also be accessed via trails from Green Mountain or Moul Falls (note that the Moul Falls Trail remains open)."},{"AdvisoryID":"47","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-14 3:08:24 PM","Headline":"Pilot bay lighthouse facility is closed due to COVID-19 concerns. The trail is open.","Description":""},{"AdvisoryID":"31","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-14","Headline":"The historic Peace Arch monument will be refurbished in the summer of 2020","Description":"<div>The work is expected to take place from July 16th to September. The work will include vapour blasting, priming, repainting, restoring inscriptions, restoring ornamental gates, and restoring the commemorative plaques. Please note the arch may not be visible during this time due to the need to wrap the structure to contain removed paint and protect the work.</div>"},{"AdvisoryID":"45","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-13 11:33:37 AM","Headline":"The park is open for day-use, although the official day-use area and playground are closed due to bank erosion","Description":""},{"AdvisoryID":"44","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-13 11:08:13 AM","Headline":"Smoke from pile burning to be visible in Smithers area","Description":"<p>To reduce the risk of wildfire in the Call Lake Provincial Park, the BC Wildfire Service and BC Parks will be burning piles of wood debris between July 13 and 24, 2020.</p> <ul><li><a href=&rdquo;docs/20200710_IB_Pile-burning-at-Call-Lake.pdf&rdquo; target=&rdquo;_blank&rdquo;>Information Bulletin</a></li> </ul>"},{"AdvisoryID":"42","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-09 4:48:37 PM","Headline":"Clearwater River Trail South - change in access","Description":"<div><font size=2 color=black>Spahats Creek footbridge out due to flood damage. Crossing the creek from the Land Bridge towards First Canyon is not possible at this time. </font></div>"},{"AdvisoryID":"40","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-09 3:00:17 PM","Headline":"Park Opening Announcement","Description":"<p>BC Parks is very pleased to announce jointly with Xeni Gwet&rsquo;in First Nation that Ts&rsquo;il?os Provincial Park is open for both day-use and overnight camping, including Nu Chugh Beniz & Gwe Da Ts&rsquo;ih campgrounds.</p> <p> BC Parks has continued to keep the health and wellbeing of our visitors, staff, park operators, and local communities as our top priority by implementing COVID-19 safety protocols and respecting continued PHO guidelines around physical distancing, </p> <p> The <a href=&rdquo;http://bcparks.ca/covid-19/docs/Camping-During-COVID-19.pdf&rdquo; target=&rdquo;_blank&rdquo;>BC Parks Guide to Camping During COVID-19</a> is an excellent resource to help you understand what to expect when you arrive at the campgrounds. The guide outlines how to prepare, set up, and stay safe while visiting BC Parks. </p> <p> All visitors to Ts&rsquo;il?os Park are asked to be fully self-contained and to have no contact with local community members in the Nemiah Valley in order to limit the chance of spreading the COVID-19 virus. The gas station, tire repair and convenience store are closed to non-residents. Visitors are reminded to check <a href=&rdquo;https://www.xenigwetin.net/&rdquo;>www.xenigwetin.net</a> for updates on access to Title Lands. </p> <p> We appreciate your ongoing cooperation as we work to keep our staff, park operators, local communities, and visitors safe. </p>"},{"AdvisoryID":"39","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-09 2:51:57 PM","Headline":"Mahood Lake Group Site closed until further notice","Description":"<div><font size=2 color=black>Due to extreme flooding conditions the group site, as well as campsites 33 and 34 at Mahood Lake campground is unusable at this time. &nbsp;Reservation holders for the sites will be notified and refunded their fees for camping. &nbsp;BC Parks will continue to monitor the water situation and update this webpage as conditions improve. </font></div>"},{"AdvisoryID":"38","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-09 1:20:58 PM","Headline":"Train line adjacent to park","Description":"<div><font size=2>Park visitors should be aware of a train line which runs alongside the park. Trains can run during the early hours of the morning which can cause some noise disruption within the park.</font></div>"},{"AdvisoryID":"37","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-09 1:18:10 PM","Headline":"Prevent raccoons from becoming food conditioned","Description":"<div><font size=2>Secure all your belongings and do not feed the raccoons. &nbsp;This [pType] has an abundant raccoon population that thrives on park visitor&rsquo;s food, garbage and other scented items. </font></div>"},{"AdvisoryID":"36","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-09 1:13:37 PM","Headline":"Construction noise","Description":"<div><font size=2>Park visitors should be aware of an excavation project currently underway across from the park between the hours of 7am - 4pm. Minor noise and vibration disruption may occur during this time. Thanks! </font></div>"},{"AdvisoryID":"35","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-09 9:43:44 AM","Headline":"BC Parks warns visitors to use extra caution due to high water in the Thompson River","Description":"<div>With all the campsites in this popular park being located along the Thompson River, and the extreme high water flows currently being experienced, BC Parks is warning our visitors to use extra caution. Extreme caution, especially with children or pets, should be exercised at this time. In some locations the river is flowing at less than a metre from the backside of campsites. Both the North and the South Thompson Rivers have peaked and extreme flows should start to subside in the next week.</div>"},{"AdvisoryID":"32","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-08 2:53:42 PM","Headline":"Please be aware of poor road conditions on industrial roads required to access this park","Description":"<div>The roads to access this park via the Menzie&rsquo;s Bay Main and the Morton Lake FSR are in poor condition. </div> <div>These roads at the present time are only maintained to an industrial standard and will be very rough in some areas. &nbsp;</div>"},{"AdvisoryID":"30","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-07 2:51:27 PM","Headline":"You are in bear country","Description":"<ul>  <li>   Coolers are not bear proof  </li>  <li>   Secure all food and attractants; unsecured attractants may result in eviction and/or fines  </li>  <li>   Dispose of garbage and grey water in approved receptacles  </li>  <li>   Never approach or feed a bear  </li>  <li>   Report all bear sightings  </li> </ul>"},{"AdvisoryID":"29","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-07 2:49:07 PM","Headline":"BC Parks warns visitors to use extra caution due to high water in the Thompson River","Description":"<div><font size=2 color=black>With all the campsites in this popular park being located along the Thompson River, and the extreme high water flows currently being experienced, BC Parks is warning our visitors to use extra caution. Extreme caution, especially with children or pets, should be exercised at this time. In some locations the river is flowing at less than a metre from the backside of campsites. Both the North and the South Thompson Rivers have peaked and extreme flows should start to subside in the next week.</font></div>"},{"AdvisoryID":"28","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-07 2:45:13 PM","Headline":"Tour buses prohibited","Description":"Tour Buses are prohibited in this park due to COVID-19 response."},{"AdvisoryID":"26","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-06 2:12:48 PM","Headline":"The Inland Lake trail may not be currently passable with all types of wheelchairs/scooters","Description":"<div>Trail work will be occurring and BC Parks will update this webpage once the work is completed. We appreciate your patience.</div>"},{"AdvisoryID":"24","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-06 1:16:21 PM","Headline":"First loop of Hampton Campground opening July 9","Description":"<div><font size=2 color=black>As of July 9th, the first loop of Hampton Campground (sites 1-24 and 79-100) will be open, including the playground and toilet shower building. Amenities in the remaining areas of the campground continue to be closed until further notice. </font></div> <div>&nbsp;</div>"},{"AdvisoryID":"20","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-07-02","Headline":"Muddy conditions on Bugaboo Forest Service Road","Description":"<div><font size=2 color=&rdquo;#333333&rdquo;>Muddy conditions on Bugaboo Forest Service Road are preventing 2 wheel drive access to the Bugaboo trailhead. Low clearance vehicles not recommended for access to the park.</font></div> <div>&nbsp;</div>"},{"AdvisoryID":"16","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-06-30","Headline":"This park is no longer closed due to COVID-19","Description":"<ul> <ul>  <li><font face=&rdquo;BC Sans&rdquo; size=2 color=black>There are no facilities, trails, or services in this park. </font><font    face=&rdquo;BC Sans&rdquo; size=2>&nbsp;</font></li>  <li><font face=&rdquo;BC Sans&rdquo; size=2 color=black>There is no access to this park due to it being on the West side of the Squamish River. </font><font    face=&rdquo;BC Sans&rdquo; size=2>&nbsp;</font></li> </ul> </ul>"},{"AdvisoryID":"17","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-06-30","Headline":"Cold Fish Lake Camp facilities closed for the season","Description":"<div>All facilities at Cold Fish Lake Camp are closed to visitors for the 2020 season. This decision has been made to ensure the continued health and safety of BC Parks visitors, employees, park contractors, volunteers and partners, and to support efforts to reduce the spread of COVID-19.</div>"},{"AdvisoryID":"18","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-06-30","Headline":"Klappan Rail Grade is impassible","Description":"<div>The Klappan Rail grade has suffered a wash out at km 30. Eaglenest Creek Trail and Didene Portage trail are no longer accessible via the Klappan Rail Grade. Access to Spatsizi Plateau Wilderness Provincial Park is possible through air charter or via the McEwan Creek Trail.</div>"},{"AdvisoryID":"11","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-06-29","Headline":"Group campsites have been repurposed at this park","Description":"Due to ongoing operational changes as part of our COVID-19 response, group campsites have been repurposed at this park for new family camping opportunities. Please check the <a href=&rdquo;/covid-19/&rdquo;>COVID-19 page</a> for the most up-to-date information."},{"AdvisoryID":"83","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-06-29","Headline":"Campground and boat launch closed","Description":"The campground and boat launch at Pennask Lake Park, at the south east end of Pennask Lake, are closed until further notice due to a hazard tree issue."},{"AdvisoryID":"8","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-06-24","Headline":"Public access to the column features is not permitted","Description":"Keremeos Columns Park does not contain the geological features that were intended to be protected at the time of establishment in the early 1930s. The column features are fully contained on private land. At this time, public access to the column features is not permitted. Viewing of the column features must be done so by using valley bottom vantage points that do not involve encroachment or access onto private land."},{"AdvisoryID":"3","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2020-06-09","Headline":"Nyrstar Mine Access","Description":"<div>To ensure public safety and maintain continued access through the active mine, the public is reminded to be respectful of the mine entrance &quot;Checkpoint&quot;, obey all No Entry signs and follow directional signage to park trailheads/parking. Mine site conditions can change rapidly and industrial mine traffic is constantly active. While visitors are safe travelling through the mine along the main road corridor, there is a safety risk if deviating into No Entry areas. Thank you for your cooperation.</div>"},{"AdvisoryID":"320","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2019-05-23","Headline":"Bridge Failure at Tay Creek","Description":"Please be advised the bridge at Tay Creek is impassable until futher notice. BC Parks is working on a solution. Thank you for your patience and understanding."},{"AdvisoryID":"135","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2018-02-28","Headline":"Athabasca River suspension bridge failure","Description":"On October 1, 2014, the suspension bridge which crosses the Athabasca River in Jasper National Park, along the land access route to Hamber Park, failed."},{"AdvisoryID":"307","Rank":"0","Alert":"Y","DisplayAdvisoryDate":"Y","AdvisoryDate":"2017-12-05","Headline":"This park was burnt over by the 2017 wildfires. The park has now been reopened.","Description":"<p>  <strong>Caution:</strong> be advised that there are significant risks associated with entering areas that have been burnt over by the 2017 wildfires. Potential risks could include: </p> <ul>  <li>   danger trees and overhead hazards &ndash; the integrity of trees whose trunks, roots or branches have been damaged by wildfire is unreliable  </li>  <li>   terrain instability resulting in landslides and falling or shifting debris and rock  </li>  <li>   amplified runoff after rainfall or snowmelt which could result in a rapid increase of water course depth and flow rates or flooding conditions  </li>  <li>   ash pits &ndash; may be deep and difficult to see  </li>  <li>   respiratory effects caused by breathing soot and charcoal for extended periods of time  </li> </ul> <p>  Post-wildfire hazards may last for several years or longer after a wildfire and may be triggered at any time with little or no warning. </p>"},{"AdvisoryID":"319","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2017-04-24","Headline":"The Haisla Nation Trapper&rsquo;s Cabin at the entrance to Brim River has been removed and will not be replaced","Description":""},{"AdvisoryID":"148","Rank":"0","Alert":"N","DisplayAdvisoryDate":"N","AdvisoryDate":"2017-02-28","Headline":"Backcountry Reservations","Description":"As of February 28, 2017, the Jedediah Island Marine Provincial Park backcountry campground offers backcountry registrations via our <a href=&rdquo;https://www.discovercamping.ca/BCCWeb/Memberships/CustomerOverNightMemberships.aspx&rdquo;>Discover Camping Backcountry Registration System</a>."},{"AdvisoryID":"126","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"2016-07-29","Headline":"Access road to Mortar and Pestle Trailhead is washed out","Description":"The access road to Mortar and Pestle Trailhead is washed out and impassable by motor vehicles."},{"AdvisoryID":"223","Rank":"0","Alert":"N","DisplayAdvisoryDate":"Y","AdvisoryDate":"","Headline":"","Description":""}]
